---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointOrientationType.ToInstanceZthenHost
enum: Autodesk.Revit.DB.AdaptivePointOrientationType
source: html/95bf6f69-8714-5342-8a43-ad4f6c8b05a7.htm
---
# Autodesk.Revit.DB.AdaptivePointOrientationType.ToInstanceZthenHost

The Z axis of the adaptive point will be oriented to the Z axis of the adaptive family instance
 the point is part of. The XY axis are determined by the XY of the geometry the point is hosted on. This option was previously named: FamilyVertical